In [2]:
import numpy as np
import pandas as pd

Series: 모든 데이터 유형을 가지는, 레이블이 지정된 1차원 배열  
DataFrame: 2차원 배열 혹은 테이블 형의 2차원 데이터 구조

In [11]:
s = pd.Series([1, 3, 5, np.nan, 6, 8])
s

0    1.0
1    3.0
2    5.0
3    NaN
4    6.0
5    8.0
dtype: float64

In [17]:
dates = pd.date_range("20130101", periods=6)
dates

DatetimeIndex(['2013-01-01', '2013-01-02', '2013-01-03', '2013-01-04',
               '2013-01-05', '2013-01-06'],
              dtype='datetime64[ns]', freq='D')

In [19]:
df = pd.DataFrame(np.random.rand(6, 4), index=dates, columns=list("ABCD"))
df

                   A         B         C         D
2013-01-01  0.870942  0.780126  0.096923  0.667648
2013-01-02  0.417757  0.374745  0.065296  0.670631
2013-01-03  0.122986  0.375408  0.829530  0.630195
2013-01-04  0.022100  0.492151  0.031495  0.853348
2013-01-05  0.577218  0.945278  0.779523  0.088042
2013-01-06  0.868372  0.043555  0.427449  0.885455

In [23]:
df2 = pd.DataFrame(
    {
        "A" : 1.0,
        "B" : pd.Timestamp("20130102"),
        "C" : pd.Series(1, index = list(range(4)), dtype="float32"),
        "D" : np.array([3]*4, dtype="int32"),
        "E" : pd.Categorical(["test", "train", "test", "train"]),
        "F" : "foo",
    }
)

df2

A          float64
B    datetime64[s]
C          float32
D            int32
E         category
F           object
dtype: object

In [26]:
df.dtypes

A    float64
B    float64
C    float64
D    float64
dtype: object

In [30]:
df2.all

<bound method DataFrame.all of      A          B    C  D      E    F
0  1.0 2013-01-02  1.0  3   test  foo
1  1.0 2013-01-02  1.0  3  train  foo
2  1.0 2013-01-02  1.0  3   test  foo
3  1.0 2013-01-02  1.0  3  train  foo>

In [34]:
df.head()
df.tail(2)

                   A         B         C         D
2013-01-05  0.577218  0.945278  0.779523  0.088042
2013-01-06  0.868372  0.043555  0.427449  0.885455

In [36]:
df.index

DatetimeIndex(['2013-01-01', '2013-01-02', '2013-01-03', '2013-01-04',
               '2013-01-05', '2013-01-06'],
              dtype='datetime64[ns]', freq='D')

In [38]:
df.columns

Index(['A', 'B', 'C', 'D'], dtype='object')

In [40]:
df.to_numpy()

array([[0.87094238, 0.78012569, 0.09692343, 0.66764777],
       [0.41775709, 0.37474468, 0.065296  , 0.67063148],
       [0.12298615, 0.37540846, 0.82952986, 0.63019501],
       [0.02210031, 0.49215122, 0.03149524, 0.85334817],
       [0.5772185 , 0.94527759, 0.77952321, 0.08804227],
       [0.86837212, 0.04355513, 0.42744855, 0.88545467]])

In [42]:
df.describe()

              A         B         C         D
count  6.000000  6.000000  6.000000  6.000000
mean   0.479896  0.501877  0.371703  0.632553
std    0.361698  0.321352  0.364461  0.287015
min    0.022100  0.043555  0.031495  0.088042
25%    0.196679  0.374911  0.073203  0.639558
50%    0.497488  0.433780  0.262186  0.669140
75%    0.795584  0.708132  0.691505  0.807669
max    0.870942  0.945278  0.829530  0.885455

In [44]:
df.T

   2013-01-01  2013-01-02  2013-01-03  2013-01-04  2013-01-05  2013-01-06
A    0.870942    0.417757    0.122986    0.022100    0.577218    0.868372
B    0.780126    0.374745    0.375408    0.492151    0.945278    0.043555
C    0.096923    0.065296    0.829530    0.031495    0.779523    0.427449
D    0.667648    0.670631    0.630195    0.853348    0.088042    0.885455

In [46]:
df.sort_index(axis=1, ascending=False)

                   D         C         B         A
2013-01-01  0.667648  0.096923  0.780126  0.870942
2013-01-02  0.670631  0.065296  0.374745  0.417757
2013-01-03  0.630195  0.829530  0.375408  0.122986
2013-01-04  0.853348  0.031495  0.492151  0.022100
2013-01-05  0.088042  0.779523  0.945278  0.577218
2013-01-06  0.885455  0.427449  0.043555  0.868372

In [49]:
df.sort_values(by="B")

                   A         B         C         D
2013-01-06  0.868372  0.043555  0.427449  0.885455
2013-01-02  0.417757  0.374745  0.065296  0.670631
2013-01-03  0.122986  0.375408  0.829530  0.630195
2013-01-04  0.022100  0.492151  0.031495  0.853348
2013-01-01  0.870942  0.780126  0.096923  0.667648
2013-01-05  0.577218  0.945278  0.779523  0.088042

In [51]:
df["A"]

2013-01-01    0.870942
2013-01-02    0.417757
2013-01-03    0.122986
2013-01-04    0.022100
2013-01-05    0.577218
2013-01-06    0.868372
Freq: D, Name: A, dtype: float64

In [55]:
df[0:3]
df["20130102":"20130104"] #slicing

                   A         B         C         D
2013-01-02  0.417757  0.374745  0.065296  0.670631
2013-01-03  0.122986  0.375408  0.829530  0.630195
2013-01-04  0.022100  0.492151  0.031495  0.853348

In [58]:
df.loc[dates[0]]

A    0.870942
B    0.780126
C    0.096923
D    0.667648
Name: 2013-01-01 00:00:00, dtype: float64

In [60]:
df.loc[:, ["A", "B"]]

                   A         B
2013-01-01  0.870942  0.780126
2013-01-02  0.417757  0.374745
2013-01-03  0.122986  0.375408
2013-01-04  0.022100  0.492151
2013-01-05  0.577218  0.945278
2013-01-06  0.868372  0.043555

In [62]:
df.loc["20130102":"20130104", ["A", "B"]]

                   A         B
2013-01-02  0.417757  0.374745
2013-01-03  0.122986  0.375408
2013-01-04  0.022100  0.492151

In [66]:
df.loc[dates[0], "A"]
df.at[dates[0], "A"]

np.float64(0.8709423826835984)

In [68]:
df.iloc[3]

A    0.022100
B    0.492151
C    0.031495
D    0.853348
Name: 2013-01-04 00:00:00, dtype: float64

In [70]:
df.iloc[3:5, 0:2]

                   A         B
2013-01-04  0.022100  0.492151
2013-01-05  0.577218  0.945278

In [72]:
df.iloc[[1, 2, 4], [0, 2]]

                   A         C
2013-01-02  0.417757  0.065296
2013-01-03  0.122986  0.829530
2013-01-05  0.577218  0.779523

In [74]:
df.iloc[1:3, :]

                   A         B         C         D
2013-01-02  0.417757  0.374745  0.065296  0.670631
2013-01-03  0.122986  0.375408  0.829530  0.630195

In [76]:
df.iloc[:, 1:3]

                   B         C
2013-01-01  0.780126  0.096923
2013-01-02  0.374745  0.065296
2013-01-03  0.375408  0.829530
2013-01-04  0.492151  0.031495
2013-01-05  0.945278  0.779523
2013-01-06  0.043555  0.427449

In [78]:
df.iloc[1, 1]

np.float64(0.37474467847013326)

In [79]:
df.iat[1, 1]

np.float64(0.37474467847013326)

In [81]:
df[df["A"] > 0]

                   A         B         C         D
2013-01-01  0.870942  0.780126  0.096923  0.667648
2013-01-02  0.417757  0.374745  0.065296  0.670631
2013-01-03  0.122986  0.375408  0.829530  0.630195
2013-01-04  0.022100  0.492151  0.031495  0.853348
2013-01-05  0.577218  0.945278  0.779523  0.088042
2013-01-06  0.868372  0.043555  0.427449  0.885455

In [83]:
df[df > 0]

                   A         B         C         D
2013-01-01  0.870942  0.780126  0.096923  0.667648
2013-01-02  0.417757  0.374745  0.065296  0.670631
2013-01-03  0.122986  0.375408  0.829530  0.630195
2013-01-04  0.022100  0.492151  0.031495  0.853348
2013-01-05  0.577218  0.945278  0.779523  0.088042
2013-01-06  0.868372  0.043555  0.427449  0.885455

In [86]:
df2 = df.copy()
df2["E"] = ["one", "one", "two", "three", "four", "three"]
df2

                   A         B         C         D      E
2013-01-01  0.870942  0.780126  0.096923  0.667648    one
2013-01-02  0.417757  0.374745  0.065296  0.670631    one
2013-01-03  0.122986  0.375408  0.829530  0.630195    two
2013-01-04  0.022100  0.492151  0.031495  0.853348  three
2013-01-05  0.577218  0.945278  0.779523  0.088042   four
2013-01-06  0.868372  0.043555  0.427449  0.885455  three

In [97]:
s1 = pd.Series([1, 2, 3, 4, 5, 6], index=pd.date_range("20130102", periods=6))
s1

2013-01-02    1
2013-01-03    2
2013-01-04    3
2013-01-05    4
2013-01-06    5
2013-01-07    6
Freq: D, dtype: int64

In [98]:
df["F"] = s1
df.at[dates[0], "A"] = 0
df

                   A         B         C    D    F
2013-01-01  0.000000  0.000000  0.096923  5.0  NaN
2013-01-02  0.417757  0.374745  0.065296  5.0  1.0
2013-01-03  0.122986  0.375408  0.829530  5.0  2.0
2013-01-04  0.022100  0.492151  0.031495  5.0  3.0
2013-01-05  0.577218  0.945278  0.779523  5.0  4.0
2013-01-06  0.868372  0.043555  0.427449  5.0  5.0

In [99]:
df.iat[0, 1] = 0
df

                   A         B         C    D    F
2013-01-01  0.000000  0.000000  0.096923  5.0  NaN
2013-01-02  0.417757  0.374745  0.065296  5.0  1.0
2013-01-03  0.122986  0.375408  0.829530  5.0  2.0
2013-01-04  0.022100  0.492151  0.031495  5.0  3.0
2013-01-05  0.577218  0.945278  0.779523  5.0  4.0
2013-01-06  0.868372  0.043555  0.427449  5.0  5.0

In [101]:
df.loc[:, "D"] = np.array([5] * len(df))
df

                   A         B         C    D    F
2013-01-01  0.000000  0.000000  0.096923  5.0  NaN
2013-01-02  0.417757  0.374745  0.065296  5.0  1.0
2013-01-03  0.122986  0.375408  0.829530  5.0  2.0
2013-01-04  0.022100  0.492151  0.031495  5.0  3.0
2013-01-05  0.577218  0.945278  0.779523  5.0  4.0
2013-01-06  0.868372  0.043555  0.427449  5.0  5.0

In [103]:
df2 = df.copy()
df2[df2>0] = - df2
df2

                   A         B         C    D    F
2013-01-01  0.000000  0.000000 -0.096923 -5.0  NaN
2013-01-02 -0.417757 -0.374745 -0.065296 -5.0 -1.0
2013-01-03 -0.122986 -0.375408 -0.829530 -5.0 -2.0
2013-01-04 -0.022100 -0.492151 -0.031495 -5.0 -3.0
2013-01-05 -0.577218 -0.945278 -0.779523 -5.0 -4.0
2013-01-06 -0.868372 -0.043555 -0.427449 -5.0 -5.0